[
    {
        "input": "Context: Implement sharding in the Activity MongoDB Cluster to avoid going beyond the AWS EBS hard limit of 16 TB per cluster by splitting the data across multiple shards. There are 10 collections in this cluster and 3 collections occupy around 14 TB of data already. Choosing the sharding key is critical to achieve balanace between uniform distribution across the shard nodes and query locality. Query: This story is to track the development efforts required to implement sharding in the Activity MongoDB Cluster. Break down the tasks involved with a high-level estimate to build and test each and every criterion to achieve the sharding",
        "output": "Ticket Title: Implement Sharding in Activity MongoDB Cluster. Description: The purpose of this ticket is to outline the detailed steps for implementing sharding in the Activity MongoDB Cluster to avoid going beyond the AWS EBS hard limit of 16 TB per cluster by splitting the data across multiple shards. Acceptance Criteria: 1. The project should include clear documentation outlining the sharding implementation process. 2. Multiple shards should be utilized. 3. Data distribution should be as uniform as possible across shards. 4. Read queries should be executed as close to the shard node(s) hosting the data. Issue Priority: High (Finalization Phase): Development, Comprehensive documentation including technical specs, milestone tracking, and final acceptance report. Issue Category: Infrastructure Improvements & Database Scalability"
    },
    {
        "input": "Context: Implement Retry mechanism whenever there is a failure between producer and Broker. The producer should retry sending the message to the broker with an exponential backoff strategy. This is to ensure that the messages are not lost in case of transient failures. Query: Fix the message loss in the producer application that occurs whenever the Broker is temporarily unavailable. This is resulting in processing failures and customer complaints often",
        "output": "Ticket Title: Implement Retry Mechanism for Producer-Broker Communication. Description: The purpose of this ticket is to outline the detailed steps for implementing a retry mechanism in the producer application to handle transient failures when communicating with the broker. Acceptance Criteria: 1. Broker unavailability should be detected. 2. Back-off based retries should be implemented. and 3. Functional and message Failures should be avoided. Issue Priority: High as it's a critical fix. Issue Category: Data Resilience & Reliability"
    }
]